blog/app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Good title"], ["body", "Good body should be done"], ["updated_at", "2021-05-20 12:09:30.340150"], ["id", 4]]